Revit 2027 API
Outline.Scale Method
 Scales the bounding box by given scale.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Scale(
	double scale
)
Public Sub Scale (
	scale As Double
)
public:
void Scale(
	double scale
)
member Scale :
        scale : float -> unit
Parameters
scale Double
 The scale value. It should be greater than zero.
Exceptions
Exception | Condition
ArgumentException |  The scale is invalid.
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace